Artillery/postTest.yml
config:
  target: "http://3.17.167.113:3001/"
  processor: "./processors.js"
  phases:
    - duration: 10
      arrivalRate: 1000
scenarios:
  - flow:
      - function: "post"
      - post:
          url: "/api/airbnb.users/"
          json:
            user_id: "{{user_id}}"
            name: "{{name}}"
            imageUrl: "{{imageUrl}}"
            body: "{{body}}"
            cleanliness: "{{cleanliness}}"
            communication: "{{communication}}"
            value: "{{value}}"
            accuracy: "{{accuracy}}"
            checkIn: "{{checkIn}}"
            location: "{{location}}"